import Section1 from "./components/Section1";
import Section2 from "./components/Section2";
import Section3 from "./components/Section3";
import Section4 from "./components/Section4";

// ────────────────────────────────────────────────────────── I ──────────
//   :::::: C O M P O N E N T : :  :   :    :     :        :          :
// ────────────────────────────────────────────────────────────────────
//
export default function Index() {
  // ─── Global Variable ────────────────────────────────────────────────────────────

  // ─── States ─────────────────────────────────────────────────────────────────────

  // ─── Life Cycle ─────────────────────────────────────────────────────────────────

  // ─── Functions ──────────────────────────────────────────────────────────────────

  //
  // ──────────────────────────────────────────────────── I ──────────
  //   :::::: R E N D E R : :  :   :    :     :        :          :
  // ──────────────────────────────────────────────────────────────
  //
  return (
    <>
      <section className="">
        <section className="my-[80px] flex h-[150px] w-full items-center justify-center bg-blue text-[50px] font-bold  text-white ">
          <h1>تضمین ماشین</h1>
        </section>
        <Section1 />
        {/* <Section2
          src="/assets/images/Selfi_Final.jpg"
          title="ماموریت ما"
          text="با بهره گیری از فناوری، برای مشتریانمان تجربه خوشایند خرید و برای
              فروشندگان مارکت پلیس، تجربه خوب فروش ایجاد می‌کنیم. می‌خواهیم به
              کسب‌وکارهای ایرانی کمک کنیم تا با قدرت تکنولوژی کالاهای خود را
              بیشتر و بهتر به فروش برسانند. کمک به گذار از اقتصاد سنتی به اقتصاد
              دیجیتال، همسو با روندهای جهانی، مأموریت ما برای گسترش بازاری به
              وسعت ایران و منطقه خاورمیانه برای همه فروشندگان است. بدون شک این
              رسالت با رشد شایستگی های حرفه‌ای همکاران دیجی‌کالا امکان پذیر است."
        />
        <Section2
          position="order-last"
          titlePositin="text-end"
          src="/assets/images/cheshmandaz.jpg"
          title="چشم‌انداز ما"
          text=" تبدیل شدن به برترین پلتفرم تجارت الکترونیک در خاورمیانه، دورنمای ما برای گام برداشتن در مسیر پر چالش خرید و فروش آنلاین است. برای رسیدن به این تصویر تمام توان خود را برای قدم گذاشتن در مسیرهای جدید به کار می‌گیریم."
        />
        <Section3 />
        <Section2
          src="/assets/images/cheshmandaz.jpg"
          title="هویت ما با لبخند شما"
          text="هویتمان را با لبخند تعریف کرده‌ایم. پس از تغییر هویت بصری دیجی‌کالا در ابتدای سال ۹۹ تمامی پیام‌های دیجی‌کالا را همراه با طرح لبخندی به نشانه تلاش برای ثبت تجربه‌ای خوشایند از خرید و فروش طراحی و به دست مخاطبان می‌رسانیم. هویت بصری جدید ما را در رنگ‌ها، لوگوها، تایپوگرافی‌ها و الگوها دنبال کنید. "
        />
        <Section4 /> */}
      </section>
    </>
  );
}
